Основные_объекты_Занятие_5/src/Documents/ПриказОбУвольнении/ПриказОбУвольнении.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриказОбУвольнении</name>
  <basedOn>Catalog.Сотрудники</basedOn>
  <basedOn>Document.ПриказОПриеме</basedOn>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
</mdclass:Document>

Основные_объекты_Занятие_5/src/Catalogs/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сотрудники</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Неприкасаемые</name>
      <description>Неприкасаемые</description>
    </items>
    <items>
      <name>Принятые</name>
      <description>Принятые</description>
    </items>
  </predefined>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолФизическихЛиц</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТрудоваяКнижка</name>
    <attributes>
      <name>МестоРаботы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПриема</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаУвольнения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Основные_объекты_Занятие_5/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ОсновнойМенеджер</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаРасчетов</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКонтрагента</name>
    <type>
      <types>EnumRef.ВидыКонтрагентов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Менеджеры</name>
    <attributes>
      <name>Менеджер</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Основные_объекты_Занятие_5/src/Documents/ПриказОбУвольнении/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ВыборкаИзСправочника = Справочники.Склады.Выбрать();
	
	Пока ВыборкаИзСправочника.Следующий() Цикл
		
		Если ВыборкаИзСправочника.Ответственный = Сотрудник Тогда
		
			  СправочникОбъект = ВыборкаИзСправочника.ПолучитьОбъект();
			  
			  СправочникОбъект.Ответственный = Справочники.Сотрудники.ПустаяСсылка();
			  
			  СправочникОбъект.Записать();
			  
		КонецЕсли;
		
	
	КонецЦикла;
	
	УдалитьИзМенеджеров();
	
	//Отказ = Истина;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Сотрудники") Тогда
		
		Сотрудник = ДанныеЗаполнения;
		Должность = ДанныеЗаполнения.Должность;
		Подразделение = ДанныеЗаполнения.Подразделение;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПриказОПриеме") Тогда

		Должность = ДанныеЗаполнения.Должность;
		Подразделение = ДанныеЗаполнения.Подразделение;
		Сотрудник = ДанныеЗаполнения.Сотрудник;
		
	КонецЕсли;

КонецПроцедуры


Процедура УдалитьИзМенеджеров()
	
	Выборка = Справочники.Контрагенты.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ЭтоГруппа Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		//Неявное объявление переменных
		НадоУдалятьИзТабличнойЧастиМенеджеры = Ложь;
		СтрокаТЧДляУдаления = Неопределено;
		
		НадоУдалятьИзОсновногоМенеджера = Ложь;
		МенеджерНаЗамену = Справочники.Сотрудники.ПустаяСсылка();
		
		//Проверяем табличную часть на наличие увольняемого сотрудника
		Для каждого ТекСТрока Из Выборка.Менеджеры Цикл
			
			Если ТекСТрока.Менеджер = Сотрудник Тогда
				
				НадоУдалятьИзТабличнойЧастиМенеджеры = Истина;

			Иначе
				
				МенеджерНаЗамену = ТекСТрока.Менеджер;
			
			КонецЕсли; 
			
		КонецЦикла;
		
		//Проверяем основного менеджера
		Если Выборка.ОсновнойМенеджер = Сотрудник Тогда
		
			НадоУдалятьИзОсновногоМенеджера = Истина;
		
		КонецЕсли;
		
		Если НадоУдалятьИзОсновногоМенеджера Или НадоУдалятьИзТабличнойЧастиМенеджеры Тогда
			
			СправочникОбъект = Выборка.ПолучитьОбъект();
			
			Если НадоУдалятьИзОсновногоМенеджера Тогда
			
				СправочникОбъект.ОсновнойМенеджер = МенеджерНаЗамену;
			
			КонецЕсли; 
			
			Если НадоУдалятьИзТабличнойЧастиМенеджеры Тогда
			
				 СтрокаТЧДляУдаления = СправочникОбъект.Менеджеры.Найти(Сотрудник,"Менеджер");
				 
				 СправочникОбъект.Менеджеры.Удалить(СтрокаТЧДляУдаления);
				 
			 КонецЕсли;
			 
			 СправочникОбъект.Записать();
		
		КонецЕсли;
		
		
	КонецЦикла;
	
КонецПроцедуры
